---
type: IFCImportOptions
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 13
tags: [revit-api, class]
---

# IFCImportOptions

`Autodesk.Revit.DB.IFC.IFCImportOptions` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCImportOptions | 2015 | `public IFCImportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConversionData | 2015 | `public LinkConversionData GetConversionData ()` |
| Method | GetExtraOptions | 2018.1 | `public IDictionary < string , string > GetExtraOptions ()` |
| Method | SetExtraOptions | 2018.1 | `public void SetExtraOptions ( IDictionary < string , string > options )` |
| Property | Action | 2015 | `public IFCImportAction Action { get ; set ; }` |
| Property | AutoJoin | 2015 | `public bool AutoJoin { get ; set ; }` |
| Property | AutocorrectOffAxisLines | 2016 | `public bool AutocorrectOffAxisLines { get ; set ; }` |
| Property | CreateLinkInstanceOnly | 2015 | `public bool CreateLinkInstanceOnly { get ; set ; }` |
| Property | ForceImport | 2015 | `public bool ForceImport { get ; set ; }` |
| Property | Intent | 2015 | `public IFCImportIntent Intent { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | RevitLinkFileName | 2015 | `public string RevitLinkFileName { get ; set ; }` |